RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/startup_system_files/iar/startup_msp432e411y_ewarm.c
//*****************************************************************************
//
// Copyright (C) 2018 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//  Redistributions of source code must retain the above copyright
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the
//  documentation and/or other materials provided with the
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// MSP432 Startup Code and interrupt vectors for IAR Embedded Workbench for ARM
//
//*****************************************************************************

#include <stdint.h>

//*****************************************************************************
//
// Enable the IAR extensions for this source file.
//
//*****************************************************************************
#pragma language=extended
#pragma segment="CSTACK"

//*****************************************************************************
//
// Forward declaration of the default fault handlers.
//
//*****************************************************************************
extern void Reset_Handler           (void);
static void Default_Handler         (void);

extern void NMI_Handler             (void);
extern void HardFault_Handler       (void);
extern void MemManage_Handler       (void);
extern void BusFault_Handler        (void);
extern void UsageFault_Handler      (void);
extern void SVC_Handler             (void);
extern void DebugMon_Handler        (void);
extern void PendSV_Handler          (void);
extern void SysTick_Handler         (void);

/* device specific interrupt handler */
extern void GPIOA_IRQHandler        (void);
extern void GPIOB_IRQHandler        (void);
extern void GPIOC_IRQHandler        (void);
extern void GPIOD_IRQHandler        (void);
extern void GPIOE_IRQHandler        (void);
extern void UART0_IRQHandler        (void);
extern void UART1_IRQHandler        (void);
extern void SSI0_IRQHandler         (void);
extern void I2C0_IRQHandler         (void);
extern void PWM0_FAULT_IRQHandler   (void);
extern void PWM0_0_IRQHandler       (void);
extern void PWM0_1_IRQHandler       (void);
extern void PWM0_2_IRQHandler       (void);
extern void QEI0_IRQHandler         (void);
extern void ADC0SS0_IRQHandler      (void);
extern void ADC0SS1_IRQHandler      (void);
extern void ADC0SS2_IRQHandler      (void);
extern void ADC0SS3_IRQHandler      (void);
extern void WATCHDOG_IRQHandler     (void);
extern void TIMER0A_IRQHandler      (void);
extern void TIMER0B_IRQHandler      (void);
extern void TIMER1A_IRQHandler      (void);
extern void TIMER1B_IRQHandler      (void);
extern void TIMER2A_IRQHandler      (void);
extern void TIMER2B_IRQHandler      (void);
extern void COMP0_IRQHandler        (void);
extern void COMP1_IRQHandler        (void);
extern void COMP2_IRQHandler        (void);
extern void SYSCTL_IRQHandler       (void);
extern void FLASH_IRQHandler        (void);
extern void GPIOF_IRQHandler        (void);
extern void GPIOG_IRQHandler        (void);
extern void GPIOH_IRQHandler        (void);
extern void UART2_IRQHandler        (void);
extern void SSI1_IRQHandler         (void);
extern void TIMER3A_IRQHandler      (void);
extern void TIMER3B_IRQHandler      (void);
extern void I2C1_IRQHandler         (void);
extern void CAN0_IRQHandler         (void);
extern void CAN1_IRQHandler         (void);
extern void EMAC0_IRQHandler        (void);
extern void HIBERNATE_IRQHandler    (void);
extern void USB0_IRQHandler         (void);
extern void PWM0_3_IRQHandler       (void);
extern void UDMA_IRQHandler         (void);
extern void UDMAERR_IRQHandler      (void);
extern void ADC1SS0_IRQHandler      (void);
extern void ADC1SS1_IRQHandler      (void);
extern void ADC1SS2_IRQHandler      (void);
extern void ADC1SS3_IRQHandler      (void);
extern void EPI0_IRQHandler         (void);
extern void GPIOJ_IRQHandler        (void);
extern void GPIOK_IRQHandler        (void);
extern void GPIOL_IRQHandler        (void);
extern void SSI2_IRQHandler         (void);
extern void SSI3_IRQHandler         (void);
extern void UART3_IRQHandler        (void);
extern void UART4_IRQHandler        (void);
extern void UART5_IRQHandler        (void);
extern void UART6_IRQHandler        (void);
extern void UART7_IRQHandler        (void);
extern void I2C2_IRQHandler         (void);
extern void I2C3_IRQHandler         (void);
extern void TIMER4A_IRQHandler      (void);
extern void TIMER4B_IRQHandler      (void);
extern void TIMER5A_IRQHandler      (void);
extern void TIMER5B_IRQHandler      (void);
extern void SYSEXC_IRQHandler       (void);
extern void I2C4_IRQHandler         (void);
extern void I2C5_IRQHandler         (void);
extern void GPIOM_IRQHandler        (void);
extern void GPION_IRQHandler        (void);
extern void TAMPER0_IRQHandler      (void);
extern void GPIOP0_IRQHandler       (void);
extern void GPIOP1_IRQHandler       (void);
extern void GPIOP2_IRQHandler       (void);
extern void GPIOP3_IRQHandler       (void);
extern void GPIOP4_IRQHandler       (void);
extern void GPIOP5_IRQHandler       (void);
extern void GPIOP6_IRQHandler       (void);
extern void GPIOP7_IRQHandler       (void);
extern void GPIOQ0_IRQHandler       (void);
extern void GPIOQ1_IRQHandler       (void);
extern void GPIOQ2_IRQHandler       (void);
extern void GPIOQ3_IRQHandler       (void);
extern void GPIOQ4_IRQHandler       (void);
extern void GPIOQ5_IRQHandler       (void);
extern void GPIOQ6_IRQHandler       (void);
extern void GPIOQ7_IRQHandler       (void);
extern void GPIOR_IRQHandler        (void);
extern void GPIOS_IRQHandler        (void);
extern void SHA0_IRQHandler         (void);
extern void AES0_IRQHandler         (void);
extern void DES0_IRQHandler         (void);
extern void LCD0_IRQHandler         (void);
extern void TIMER6A_IRQHandler      (void);
extern void TIMER6B_IRQHandler      (void);
extern void TIMER7A_IRQHandler      (void);
extern void TIMER7B_IRQHandler      (void);
extern void I2C6_IRQHandler         (void);
extern void I2C7_IRQHandler         (void);
extern void ONEWIRE0_IRQHandler     (void);
extern void I2C8_IRQHandler         (void);
extern void I2C9_IRQHandler         (void);
extern void GPIOT_IRQHandler        (void);

/* Cortex-M4 Processor Exceptions */
#pragma weak NMI_Handler=Default_Handler
#pragma weak HardFault_Handler=Default_Handler
#pragma weak MemManage_Handler=Default_Handler
#pragma weak BusFault_Handler=Default_Handler
#pragma weak UsageFault_Handler=Default_Handler
#pragma weak SVC_Handler=Default_Handler
#pragma weak DebugMon_Handler=Default_Handler
#pragma weak PendSV_Handler=Default_Handler
#pragma weak SysTick_Handler=Default_Handler

/* device specific interrupt handler */
#pragma weak GPIOA_IRQHandler=Default_Handler
#pragma weak GPIOB_IRQHandler=Default_Handler
#pragma weak GPIOC_IRQHandler=Default_Handler
#pragma weak GPIOD_IRQHandler=Default_Handler
#pragma weak GPIOE_IRQHandler=Default_Handler
#pragma weak UART0_IRQHandler=Default_Handler
#pragma weak UART1_IRQHandler=Default_Handler
#pragma weak SSI0_IRQHandler=Default_Handler
#pragma weak I2C0_IRQHandler=Default_Handler
#pragma weak PWM0_FAULT_IRQHandler=Default_Handler
#pragma weak PWM0_0_IRQHandler=Default_Handler
#pragma weak PWM0_1_IRQHandler=Default_Handler
#pragma weak PWM0_2_IRQHandler=Default_Handler
#pragma weak QEI0_IRQHandler=Default_Handler
#pragma weak ADC0SS0_IRQHandler=Default_Handler
#pragma weak ADC0SS1_IRQHandler=Default_Handler
#pragma weak ADC0SS2_IRQHandler=Default_Handler
#pragma weak ADC0SS3_IRQHandler=Default_Handler
#pragma weak WATCHDOG_IRQHandler=Default_Handler
#pragma weak TIMER0A_IRQHandler=Default_Handler
#pragma weak TIMER0B_IRQHandler=Default_Handler
#pragma weak TIMER1A_IRQHandler=Default_Handler
#pragma weak TIMER1B_IRQHandler=Default_Handler
#pragma weak TIMER2A_IRQHandler=Default_Handler
#pragma weak TIMER2B_IRQHandler=Default_Handler
#pragma weak COMP0_IRQHandler=Default_Handler
#pragma weak COMP1_IRQHandler=Default_Handler
#pragma weak COMP2_IRQHandler=Default_Handler
#pragma weak SYSCTL_IRQHandler=Default_Handler
#pragma weak FLASH_IRQHandler=Default_Handler
#pragma weak GPIOF_IRQHandler=Default_Handler
#pragma weak GPIOG_IRQHandler=Default_Handler
#pragma weak GPIOH_IRQHandler=Default_Handler
#pragma weak UART2_IRQHandler=Default_Handler
#pragma weak SSI1_IRQHandler=Default_Handler
#pragma weak TIMER3A_IRQHandler=Default_Handler
#pragma weak TIMER3B_IRQHandler=Default_Handler
#pragma weak I2C1_IRQHandler=Default_Handler
#pragma weak CAN0_IRQHandler=Default_Handler
#pragma weak CAN1_IRQHandler=Default_Handler
#pragma weak EMAC0_IRQHandler=Default_Handler
#pragma weak HIBERNATE_IRQHandler=Default_Handler
#pragma weak USB0_IRQHandler=Default_Handler
#pragma weak PWM0_3_IRQHandler=Default_Handler
#pragma weak UDMA_IRQHandler=Default_Handler
#pragma weak UDMAERR_IRQHandler=Default_Handler
#pragma weak ADC1SS0_IRQHandler=Default_Handler
#pragma weak ADC1SS1_IRQHandler=Default_Handler
#pragma weak ADC1SS2_IRQHandler=Default_Handler
#pragma weak ADC1SS3_IRQHandler=Default_Handler
#pragma weak EPI0_IRQHandler=Default_Handler
#pragma weak GPIOJ_IRQHandler=Default_Handler
#pragma weak GPIOK_IRQHandler=Default_Handler
#pragma weak GPIOL_IRQHandler=Default_Handler
#pragma weak SSI2_IRQHandler=Default_Handler
#pragma weak SSI3_IRQHandler=Default_Handler
#pragma weak UART3_IRQHandler=Default_Handler
#pragma weak UART4_IRQHandler=Default_Handler
#pragma weak UART5_IRQHandler=Default_Handler
#pragma weak UART6_IRQHandler=Default_Handler
#pragma weak UART7_IRQHandler=Default_Handler
#pragma weak I2C2_IRQHandler=Default_Handler
#pragma weak I2C3_IRQHandler=Default_Handler
#pragma weak TIMER4A_IRQHandler=Default_Handler
#pragma weak TIMER4B_IRQHandler=Default_Handler
#pragma weak TIMER5A_IRQHandler=Default_Handler
#pragma weak TIMER5B_IRQHandler=Default_Handler
#pragma weak SYSEXC_IRQHandler=Default_Handler
#pragma weak I2C4_IRQHandler=Default_Handler
#pragma weak I2C5_IRQHandler=Default_Handler
#pragma weak GPIOM_IRQHandler=Default_Handler
#pragma weak GPION_IRQHandler=Default_Handler
#pragma weak TAMPER0_IRQHandler=Default_Handler
#pragma weak GPIOP0_IRQHandler=Default_Handler
#pragma weak GPIOP1_IRQHandler=Default_Handler
#pragma weak GPIOP2_IRQHandler=Default_Handler
#pragma weak GPIOP3_IRQHandler=Default_Handler
#pragma weak GPIOP4_IRQHandler=Default_Handler
#pragma weak GPIOP5_IRQHandler=Default_Handler
#pragma weak GPIOP6_IRQHandler=Default_Handler
#pragma weak GPIOP7_IRQHandler=Default_Handler
#pragma weak GPIOQ0_IRQHandler=Default_Handler
#pragma weak GPIOQ1_IRQHandler=Default_Handler
#pragma weak GPIOQ2_IRQHandler=Default_Handler
#pragma weak GPIOQ3_IRQHandler=Default_Handler
#pragma weak GPIOQ4_IRQHandler=Default_Handler
#pragma weak GPIOQ5_IRQHandler=Default_Handler
#pragma weak GPIOQ6_IRQHandler=Default_Handler
#pragma weak GPIOQ7_IRQHandler=Default_Handler
#pragma weak GPIOR_IRQHandler=Default_Handler
#pragma weak GPIOS_IRQHandler=Default_Handler
#pragma weak SHA0_IRQHandler=Default_Handler
#pragma weak AES0_IRQHandler=Default_Handler
#pragma weak DES0_IRQHandler=Default_Handler
#pragma weak LCD0_IRQHandler=Default_Handler
#pragma weak TIMER6A_IRQHandler=Default_Handler
#pragma weak TIMER6B_IRQHandler=Default_Handler
#pragma weak TIMER7A_IRQHandler=Default_Handler
#pragma weak TIMER7B_IRQHandler=Default_Handler
#pragma weak I2C6_IRQHandler=Default_Handler
#pragma weak I2C7_IRQHandler=Default_Handler
#pragma weak ONEWIRE0_IRQHandler=Default_Handler
#pragma weak I2C8_IRQHandler=Default_Handler
#pragma weak I2C9_IRQHandler=Default_Handler
#pragma weak GPIOT_IRQHandler=Default_Handler

//*****************************************************************************
//
// The reference for the device initialization.
//
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
//
// The entry point for the application startup code.
//
//*****************************************************************************
extern void __iar_program_start(void);

//*****************************************************************************
//
// A union that describes the entries of the vector table.  The union is needed
// since the first entry is the stack pointer and the remainder are function
// pointers.
//
//*****************************************************************************
typedef union
{
    void (*handler)(void);
    uint32_t ptr;
}
uVectorEntry;

